app/Controllers/Auth.php

    public function authenticate()
    {
        $session = session();
        $input = $this->request->getPost();

        // 1. Validation Rules
        $rules = [
            'username' => 'required',
            'password' => 'required',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput();
        }

        $username = $input['username'];
        $rawPassword = $input['password'];

        // 2. Look up user by username
        $user = $this->userModel->where('username', $username)->first();

        if ($user) {
            // 3. Verify the password hash
            if (password_verify($rawPassword, $user['password'])) {

                // 4. Check if employee is active (for role_id = 2)
                if ($user['role_id'] == 2 && !empty($user['employee_id'])) {
                    $db = \Config\Database::connect();
                    $employee = $db->table('employees')
                        ->where('id', $user['employee_id'])
                        ->get()
                        ->getRow();
---
SELECT *
FROM `users`
WHERE `username` = 'rameshpilli1428@gmail.com'
 LIMIT 1
SELECT *
FROM `employees`
WHERE `id` = '23'


                // 5. Fetch the role name
                $db = \Config\Database::connect();
                $role = $db->table('roles')
                    ->select('name')
                    ->where('id', $user['role_id'])
                    ->get()
                    ->getRow();
---
SELECT `name`
FROM `roles`
WHERE `id` = '2'