app/Controllers/ClientReport.php

SELECT *
FROM `clients`
WHERE `user_id` = '40'
 LIMIT 1
SELECT *
FROM `client_reports`
WHERE `id` = '2'
AND `client_id` = '19'
---
    public function clientReportView($reportId)
    {
        $roleId = session()->get('role_id');
        $userId = session()->get('user_id');
        $clientId = null;

        if ($roleId == 3) {
            $clientRec = $this->clientModel->where('user_id', $userId)->first();
            $clientId = $clientRec ? $clientRec['id'] : null;
        } elseif ($roleId == 4) {
            $clientRec = $this->clientModel->where('client_manager_id', $userId)->first();
            $clientId = $clientRec ? $clientRec['id'] : null;
        }

        $report = $this->db->table('client_reports')->where('id', $reportId)->where('client_id', $clientId)->get()->getRowArray();