app/Controllers/ClientPayment.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = '19'
---
    public function index($clientId)
    {
        $client = $this->clientModel->find($clientId);