app/Controllers/ClientDashboard.php

    private function getClientId()
    {
        $roleId = session()->get('role_id');

        // Regular client (role_id = 3) - get from session
        if ($roleId == 3) {
            return session()->get('client_id');
        }

        // Client manager (role_id = 4) - get from users table
        if ($roleId == 4) {
            $userId = session()->get('user_id');
            $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '47'

    public function index()
    {
        $userId = session()->get('user_id');
         $clientId = $this->getClientId();

        if (!$clientId) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Client information not found.');
        }

        // Get client details
        $client = $this->clientModel->find($clientId);

        if (!$client) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Client not found.');
        }

        // Get statistics
        // FIXED: Count only admin uploaded Excel files
        $totalFiles = $this->clientFileModel
            ->where('client_id', $clientId)
            ->where('uploaded_by', 'admin')
            ->groupStart()
            ->like('original_name', '.xls', 'both')
            ->orLike('original_name', '.xlsx', 'both')
            ->groupEnd()
            ->countAllResults();
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = '19'
SELECT COUNT(*) AS `numrows`
FROM `client_files`
WHERE `client_id` = '19'
AND `uploaded_by` = 'admin'
AND   (
`original_name` LIKE '%.xls%' ESCAPE '!'
OR  `original_name` LIKE '%.xlsx%' ESCAPE '!'
 )

            ->countAllResults();

        // NEW: Get total weekly schedules count
        $totalSchedules = $this->db->table('client_weekly_schedules')
            ->where('client_id', $clientId)
            ->where('status', 'published')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `client_weekly_schedules`
WHERE `client_id` = '19'
AND `status` = 'published'

        $weekEndDate = $sunday->format('Y-m-d');

        // Get weekly schedule from database
        $weeklySchedule = $this->db->table('client_weekly_schedules')
            ->where('client_id', $clientId)
            ->where('week_start_date', $weekStartDate)
            ->where('status', 'published')
            ->get()
            ->getRowArray();
---
SELECT *
FROM `client_weekly_schedules`
WHERE `client_id` = '19'
AND `week_start_date` = '2025-11-03'
AND `status` = 'published'

        }

        // Get recent tasks
        $recentTasks = $this->taskModel
            ->select('employee_tasks.*, employees.first_name as emp_first_name, employees.last_name as emp_last_name')
            ->join('employees', 'employees.id = employee_tasks.employee_id', 'left')
            ->where('employee_tasks.client_id', $clientId)
            ->orderBy('employee_tasks.submitted_at', 'DESC')
            ->limit(5)
            ->findAll();

        // NEW: Get project details count
        $totalProjects = $this->db->table('maintenance')
            ->where('client_id', $clientId)
            ->countAllResults();
---
SELECT `employee_tasks`.*, `employees`.`first_name` as `emp_first_name`, `employees`.`last_name` as `emp_last_name`
FROM `employee_tasks`
LEFT JOIN `employees` ON `employees`.`id` = `employee_tasks`.`employee_id`
WHERE `employee_tasks`.`client_id` = '19'
ORDER BY `employee_tasks`.`submitted_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `maintenance`
WHERE `client_id` = '19'

    public function uploadFiles()
    {
        $clientId = $this->getClientId();
        if (!$clientId) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Client information not found.');
        }
        $client = $this->clientModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = '19'