app/Controllers/Client.php

SELECT *
FROM `clients`
---
    public function index()
    {
        $data['clients'] = $this->clientModel->findAll();

INSERT INTO `users` (`role_id`, `first_name`, `last_name`, `email`, `username`, `phone`, `password`, `created_at`, `updated_at`) VALUES (3, 'vEGEGwge', 'VGEEg', 'raFWFqfmarao@gmail.com', 'raFWFqfmarao@gmail.com', '9876543111', '$2y$10$dBhlr/K2su/T4mAGL9i4w.i3PgEVNFiPeispCjEx7cXJUQNIeCTXm', '2025-11-01 16:23:45', '2025-11-01 16:23:45')
---
                'password' => $input['phone'], // Plain password - UserModel will hash it
            ];

            $clientUserId = $this->userModel->insert($clientUserData);

INSERT INTO `clients` (`user_id`, `name`, `owner_first_name`, `owner_last_name`, `email`, `phone`, `manager_name`, `manager_phone`, `reference`, `started_date`, `remarks`, `role_id`, `created_at`, `updated_at`) VALUES (64, 'sdgbzsreg', 'vEGEGwge', 'VGEEg', 'raFWFqfmarao@gmail.com', '9876543111', ' ', '4563423456', 'EGEWG', NULL, 'fbfza', 3, '2025-11-01 16:23:45', '2025-11-01 16:23:45')
---
                'role_id' => $this->clientRoleId,
            ];

            if (!$this->clientModel->insert($clientData)) {

UPDATE `users` SET `client_id` = 27, `company_name` = 'sdgbzsreg', `updated_at` = '2025-11-01 16:23:45'
WHERE `users`.`id` IN (64)
---
                'company_name' => $input['name'],
            ];

            if ($this->userModel->update($clientUserId, $updateClientUserData) === false) {

INSERT INTO `users` (`role_id`, `first_name`, `last_name`, `email`, `username`, `phone`, `password`, `client_id`, `company_name`, `created_at`, `updated_at`) VALUES (4, '', '', 'manager.raFWFqfmarao@gmail.com', 'manager_raFWFqfmarao@gmail.com', '4563423456', '$2y$10$87MztCRXCOh52QmS4gzLBuvMETX1p0gjufY7yCYJFl78TME7S2b5.', 27, 'sdgbzsreg', '2025-11-01 16:23:45', '2025-11-01 16:23:45')
---
                    'company_name' => $input['name'],
                ];

                $clientManagerUserId = $this->userModel->insert($clientManagerUserData);

UPDATE `clients` SET `client_manager_id` = 65, `updated_at` = '2025-11-01 16:23:46'
WHERE `clients`.`id` IN (27)
---
                $clientManagerUserId = (int)$clientManagerUserId;

                // Update client table with client_manager_id
                $this->clientModel->update($clientId, ['client_manager_id' => $clientManagerUserId]);

SELECT *
FROM `clients`
WHERE `clients`.`id` = '3'
---
    public function update($id = null)
    {
        $client = $this->clientModel->find($id);

SELECT *
FROM `clients`
WHERE `clients`.`id` = '19'
SELECT *
FROM `client_files`
WHERE `client_id` = '19'
AND `uploaded_by` != 'client'
AND `uploaded_by` != '19'
ORDER BY `uploaded_at` DESC
---
    public function files($clientId)
    {
        $client = $this->clientModel->find($clientId);
        if (!$client) {
            return redirect()->to(base_url('client'))->with('error', 'Client not found.');
        }

        // Only show ADMIN-uploaded files (exclude client self-uploads)
        $clientFiles = $this->clientFileModel
            ->where('client_id', $clientId)
            ->where('uploaded_by !=', 'client')
            ->where('uploaded_by !=', $clientId)
            ->orderBy('uploaded_at', 'DESC')
            ->findAll();