app/Controllers/ClientSocialMediaCalendar.php

SELECT *
FROM `clients`
WHERE `user_id` = '40'
---
    public function index()
    {
        $userId = session()->get('user_id');
        $roleId = session()->get('role_id');

        // Get client_id based on role
        if ($roleId == 3) {
            $client = $this->db->table('clients')
                ->where('user_id', $userId)
                ->get()
                ->getRowArray();

SELECT *
FROM `clients`
WHERE `user_id` = '40'
 LIMIT 1
---
    private function getClientId()
    {
        $roleId = session()->get('role_id');
        $userId = session()->get('user_id');

        if ($roleId == 3) {
            // For clients, get client_id from clients table
            $clientModel = new \App\Models\ClientModel();
            $client = $clientModel->where('user_id', $userId)->first();