app/Controllers/ClientAsset.php

SELECT *
FROM `clients`
---
    public function create()
    {
        $clients = $this->clientModel->findAll();