app/Controllers/ClientDashboard.php

    public function index()
    {
        $userId = session()->get('user_id');
        $clientId = session()->get('client_id');

        if (!$clientId) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Client information not found.');
        }

        // Get client details
        $client = $this->clientModel->find($clientId);

        if (!$client) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Client not found.');
        }

        // Get statistics
        $totalFiles = $this->clientFileModel->where('client_id', $clientId)->countAllResults();
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = '19'
SELECT COUNT(*) AS `numrows`
FROM `client_files`
WHERE `client_id` = '19'

            ->countAllResults();

        // Get recent tasks
        $recentTasks = $this->taskModel
            ->select('employee_tasks.*, employees.first_name as emp_first_name, employees.last_name as emp_last_name')
            ->join('employees', 'employees.id = employee_tasks.employee_id', 'left')
            ->where('employee_tasks.client_id', $clientId)
            ->orderBy('employee_tasks.submitted_at', 'DESC')
            ->limit(5)
            ->findAll();

        // Get recent admin Excel files
        $recentFiles = $this->clientFileModel
            ->where('client_id', $clientId)
            ->where('uploaded_by', 'admin')
            ->groupStart()
            ->like('original_name', '.xls', 'both')
            ->orLike('original_name', '.xlsx', 'both')
            ->groupEnd()
            ->orderBy('uploaded_at', 'DESC')
            ->limit(5)
            ->findAll();
---
SELECT `employee_tasks`.*, `employees`.`first_name` as `emp_first_name`, `employees`.`last_name` as `emp_last_name`
FROM `employee_tasks`
LEFT JOIN `employees` ON `employees`.`id` = `employee_tasks`.`employee_id`
WHERE `employee_tasks`.`client_id` = '19'
ORDER BY `employee_tasks`.`submitted_at` DESC
 LIMIT 5
SELECT *
FROM `client_files`
WHERE `client_id` = '19'
AND `uploaded_by` = 'admin'
AND   (
`original_name` LIKE '%.xls%' ESCAPE '!'
OR  `original_name` LIKE '%.xlsx%' ESCAPE '!'
 )
ORDER BY `uploaded_at` DESC
 LIMIT 5