app/Controllers/Client.php

DELETE FROM `clients`
WHERE `id` IN ('3')
---
    public function delete($id)
    {
        $client = $this->clientModel->find($id);
        if (!$client) {
            return redirect()->to(base_url('client'))->with('error', 'Client not found.');
        }

        // Delete related files, users, or other cleanup as needed here

        $this->clientModel->delete($id);