app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `clients`
SELECT COUNT(*) AS `numrows`
FROM `employees`
SELECT *
FROM `clients`
ORDER BY `created_at` DESC
 LIMIT 10
---
    private function adminDashboard()
    {
        // Get total counts
        $totalClients = $this->clientModel->countAllResults();
        $totalEmployees = $this->employeeModel->countAllResults();

        // Get pending payments (schedules with status pending or overdue)
        $pendingPayments = $this->db->query("
            SELECT COUNT(*) as count, SUM(expected_amount) as total_amount
            FROM client_payment_schedule
            WHERE status IN ('pending', 'overdue')
        ")->getRowArray();

        // Get recent clients (last 10)
        $recentClients = $this->clientModel
            ->orderBy('created_at', 'DESC')
            ->limit(10)
            ->findAll();