app/Controllers/EmployeeDashboard.php

    public function index()
    {
        $userId = session()->get('user_id');
        $user = $this->userModel->find($userId);

        if (!$user || !isset($user['employee_id'])) {
            return redirect()->to(base_url('dashboard'))->with('error', 'Employee record not found.');
        }

        $employeeId = $user['employee_id'];

        // Get task statistics for this employee
        $totalTasks = $this->taskModel->where('employee_id', $employeeId)->countAllResults();
        $completedTasks = $this->taskModel->where('employee_id', $employeeId)->where('status', 'Completed')->countAllResults();
        $pendingTasks = $this->taskModel->where('employee_id', $employeeId)->whereIn('status', ['Pending', 'In Progress', 'Review'])->countAllResults();

        // Get recent tasks with client info
        $recentTasks = $this->taskModel
            ->select('employee_tasks.*, clients.name as client_name')
            ->join('clients', 'clients.id = employee_tasks.client_id', 'left')
            ->where('employee_tasks.employee_id', $employeeId)
            ->orderBy('employee_tasks.submitted_at', 'DESC')
            ->limit(5)
            ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '45'
SELECT `employee_tasks`.*, `clients`.`name` as `client_name`
FROM `employee_tasks`
LEFT JOIN `clients` ON `clients`.`id` = `employee_tasks`.`client_id`
WHERE `employee_tasks`.`employee_id` = '23'
ORDER BY `employee_tasks`.`submitted_at` DESC
 LIMIT 5