app/Controllers/HolidayManagement.php

SELECT *
FROM `holidays`
WHERE `holidays`.`id` = '5'
UPDATE `holidays` SET `holiday_name` = 'holiday ', `holiday_date` = '2025-11-07', `description` = 'svc', `is_recurring` = 0, `updated_at` = '2025-11-06 15:05:44'
WHERE `holidays`.`id` IN ('5')
---
    public function update($holidayId)
    {
        $holiday = $this->holidayModel->find($holidayId);
        if (!$holiday) {
            return redirect()->to(base_url('holidays'))
                ->with('error', 'Holiday not found.');
        }

        $input = $this->request->getPost();

        $rules = [
            'holiday_name' => 'required|min_length[3]|max_length[255]',
            'holiday_date' => 'required|valid_date',
            'description' => 'permit_empty|max_length[500]',
            'is_recurring' => 'permit_empty|in_list[0,1]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('validation', $this->validator);
        }

        $updateData = [
            'holiday_name' => $input['holiday_name'],
            'holiday_date' => $input['holiday_date'],
            'description' => $input['description'] ?? null,
            'is_recurring' => $input['is_recurring'] ?? 0
        ];

        if ($this->holidayModel->update($holidayId, $updateData)) {