app/Controllers/LeaveManagement.php

SELECT `leave_requests`.*, `users`.`first_name`, `users`.`last_name`, `users`.`email`, `employees`.`employee_code`, `departments`.`name` as `department_name`, `approver`.`first_name` as `approver_first_name`, `approver`.`last_name` as `approver_last_name`
FROM `leave_requests`
LEFT JOIN `users` ON `users`.`id` = `leave_requests`.`employee_id`
LEFT JOIN `employees` ON `employees`.`user_id` = `leave_requests`.`employee_id`
LEFT JOIN `departments` ON `departments`.`id` = `employees`.`department_id`
LEFT JOIN `users` as `approver` ON `approver`.`id` = `leave_requests`.`approved_by`
WHERE `leave_requests`.`id` = '5'
---
    public function viewLeave($leaveId)
    {
        $leave = $this->leaveModel->select('leave_requests.*,
                                       users.first_name,
                                       users.last_name,
                                       users.email,
                                       employees.employee_code,
                                       departments.name as department_name,
                                       approver.first_name as approver_first_name,
                                       approver.last_name as approver_last_name')
            ->join('users', 'users.id = leave_requests.employee_id', 'left')
            ->join('employees', 'employees.user_id = leave_requests.employee_id', 'left')
            ->join('departments', 'departments.id = employees.department_id', 'left')
            ->join('users as approver', 'approver.id = leave_requests.approved_by', 'left')
            ->find($leaveId);