app/Controllers/Notifications.php

    public function index()
    {
        $userId = session()->get('user_id');

        $notifications = $this->notificationModel->where('user_id', $userId)
                                                 ->orderBy('created_at', 'DESC')
                                                 ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '47'
ORDER BY `created_at` DESC

    public function markAsRead($notificationId)
    {
        $userId = session()->get('user_id');
        $notification = $this->notificationModel->find($notificationId);
---
SELECT *
FROM `notifications`
WHERE `notifications`.`id` = '152'