app/Models/ClientPaymentModel.php

    public function getClientPaymentsWithTotal($clientId)
    {
        return $this->where('client_id', $clientId)
                    ->orderBy('payment_date', 'DESC')
                    ->orderBy('id', 'DESC')
                    ->findAll();
---
SELECT *
FROM `client_payments`
WHERE `client_id` = '19'
ORDER BY `payment_date` DESC, `id` DESC