app/Models/ClientProjectSummaryModel.php

SELECT *
FROM `client_project_summary`
WHERE `client_id` = '19'
 LIMIT 1
---
    public function getOrCreateSummary($clientId)
    {
        $summary = $this->where('client_id', $clientId)->first();

SELECT SUM(`amount`) AS `amount`
FROM `client_payments`
WHERE `client_id` = '19'
 LIMIT 1
SELECT *
FROM `client_project_summary`
WHERE `client_id` = '19'
 LIMIT 1
UPDATE `client_project_summary` SET `total_paid` = '55000.00', `total_due` = 45000, `updated_at` = '2025-11-03 12:04:31'
WHERE `client_project_summary`.`id` IN ('2')
---
    public function recalculateTotals($clientId)
    {
        $paymentModel = new \App\Models\ClientPaymentModel();
        $totalPaid = $paymentModel->where('client_id', $clientId)->selectSum('amount')->first();

        $summary = $this->where('client_id', $clientId)->first();

        if ($summary) {
            $paid = $totalPaid['amount'] ?? 0.00;
            $due = $summary['total_project_value'] - $paid;

            $this->update($summary['id'], [
                'total_paid' => $paid,
                'total_due' => $due
            ]);