app/Models/ClientPaymentScheduleModel.php

    public function getClientSchedules($clientId)
    {
        return $this->where('client_id', $clientId)
                    ->orderBy('expected_date', 'ASC')
                    ->findAll();
---
SELECT *
FROM `client_payment_schedule`
WHERE `client_id` = '19'
ORDER BY `expected_date` ASC

    public function markOverdue()
    {
        $today = date('Y-m-d');
        $this->where('status', 'pending')
             ->where('expected_date <', $today)
             ->set(['status' => 'overdue'])
             ->update();
---
UPDATE `client_payment_schedule` SET `status` = 'overdue', `updated_at` = '2025-11-03 12:05:03'
WHERE `status` = 'pending'
AND `expected_date` < '2025-11-03'