app/Models/LeaveRequestModel.php

    public function getPendingCount()
    {
        return $this->where('status', 'pending')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `leave_requests`
WHERE `status` = 'pending'

    public function getEmployeesWithLeaveStats()
    {
        return $this->select('users.id as employee_id,
                            users.first_name,
                            users.last_name,
                            employees.employee_code,
                            COUNT(leave_requests.id) as total_leaves,
                            SUM(CASE WHEN leave_requests.status = "pending" THEN 1 ELSE 0 END) as pending_leaves,
                            SUM(CASE WHEN leave_requests.status = "approved" THEN 1 ELSE 0 END) as approved_leaves,
                            SUM(CASE WHEN leave_requests.status = "rejected" THEN 1 ELSE 0 END) as rejected_leaves,
                            SUM(CASE WHEN leave_requests.status = "approved" THEN leave_requests.total_days ELSE 0 END) as total_approved_days')
                    ->join('users', 'users.id = leave_requests.employee_id', 'left')
                    ->join('employees', 'employees.user_id = leave_requests.employee_id', 'left')
                    ->groupBy('users.id, users.first_name, users.last_name, employees.employee_code')
                    ->orderBy('pending_leaves', 'DESC')
                    ->findAll();
---
SELECT `users`.`id` as `employee_id`, `users`.`first_name`, `users`.`last_name`, `employees`.`employee_code`, COUNT(leave_requests.id) as total_leaves, SUM(CASE WHEN leave_requests.status = "pending" THEN 1 ELSE 0 END) as pending_leaves, SUM(CASE WHEN leave_requests.status = "approved" THEN 1 ELSE 0 END) as approved_leaves, SUM(CASE WHEN leave_requests.status = "rejected" THEN 1 ELSE 0 END) as rejected_leaves, SUM(CASE WHEN leave_requests.status = "approved" THEN leave_requests.total_days ELSE 0 END) as total_approved_days
FROM `leave_requests`
LEFT JOIN `users` ON `users`.`id` = `leave_requests`.`employee_id`
LEFT JOIN `employees` ON `employees`.`user_id` = `leave_requests`.`employee_id`
GROUP BY `users`.`id`, `users`.`first_name`, `users`.`last_name`, `employees`.`employee_code`
ORDER BY `pending_leaves` DESC