app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `user_id` = '47'
AND `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getUnreadNotifications($userId, $limit = 10)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

UPDATE `notifications` SET `is_read` = 1, `updated_at` = '2025-11-05 22:23:26'
WHERE `notifications`.`id` IN ('152')
---
    public function markAsRead($notificationId)
    {
        return $this->update($notificationId, ['is_read' => 1]);