app/Models/SocialMediaCalendarModel.php

SELECT `social_media_calendars`.*, `users`.`first_name` as `uploader_first_name`, `users`.`last_name` as `uploader_last_name`
FROM `social_media_calendars`
LEFT JOIN `users` ON `users`.`id` = `social_media_calendars`.`uploaded_by`
WHERE `social_media_calendars`.`client_id` = '19'
ORDER BY `social_media_calendars`.`calendar_year` DESC, `social_media_calendars`.`calendar_month` DESC
---
    public function getClientCalendarsWithUploader($clientId)
    {
        return $this->select('social_media_calendars.*,
                            users.first_name as uploader_first_name,
                            users.last_name as uploader_last_name')
            ->join('users', 'users.id = social_media_calendars.uploaded_by', 'left')
            ->where('social_media_calendars.client_id', $clientId)
            ->orderBy('social_media_calendars.calendar_year', 'DESC')
            ->orderBy('social_media_calendars.calendar_month', 'DESC')
            ->findAll();